<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Software Libre en la ense&#241;anza de la Inform&#225;tica</TITLE>
<META NAME="description" CONTENT="Software Libre en la ense&#241;anza de la Inform&#225;tica">
<META NAME="keywords" CONTENT="software libre, educación, universidad, software propietario">
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<LINK REL="STYLESHEET" HREF="sl_informatica.css">

</HEAD>

<BODY >
<H1 ALIGN="CENTER"><B>Software Libre en la ense&#241;anza de la Inform&#225;tica</B></H1>
<P ALIGN="CENTER"><STRONG>Maximiliano Eguaras - Javier Smaldone<A NAME="tex2html1"
  HREF="#foot80"><SUP>1</SUP></A>
<BR>
Alumnos de la Universidad Nacional de R&#237;o Cuarto<A NAME="tex2html2"
  HREF="#foot73"><SUP>2</SUP></A></STRONG></P>

<H3>Resumen:</H3>
<DIV align=justify>
El objetivo del presente art&#237;culo es poner de manifiesto, de forma
breve y sint&#233;tica, las ventajas de la utilizaci&#243;n del Software Libre
en la ense&#241;anza de la Inform&#225;tica, como as&#237; tambi&#233;n resaltar los peligros
que implica el uso de herramientas y tecnolog&#237;a propietaria en la
formaci&#243;n universitaria.
</DIV>

<p align=justify>

<H1><A NAME="SECTION00010000000000000000">
1 Introducci&#243;n</A>
</H1>

<p align=justify>

<H2><A NAME="SECTION00011000000000000000">
1.1 &#191;Qu&#233; es el software libre?</A>
</H2>

<p align=justify>
La Free Software Foundation<A NAME="tex2html3"
  HREF="#foot74"><SUP>3</SUP></A> define al Software Libre de la siguiente manera:

<p align=justify>
<I>&quot;Software Libre&quot; se refiere a la libertad de los usuarios
para ejecutar, copiar, distribuir, estudiar, cambiar y mejorar el
software. M&#225;s precisamente, se refiere a cuatro libertades para los
usuarios del software:</I>

<p align=justify>

<UL>
<LI><I>La libertad de ejecutar el programa, con cualquier prop&#243;sito
(libertad 0).</I>
</LI>
<LI><I>La libertad de estudiar c&#243;mo funciona el programa, y adaptarlo
a sus necesidades (libertad 1). El acceso al c&#243;digo fuente es una
precondici&#243;n para esto.</I>
</LI>
<LI><I>La libertad de distribuir copias, con lo que puede ayudar a
su vecino (libertad 2).</I>
</LI>
<LI><I>La libertad de mejorar el programa y hacer p&#250;blicas las mejoras
a los dem&#225;s, de modo que toda la comunidad se beneficie (libertad
3). El acceso al c&#243;digo fuente es una precondici&#243;n para esto. </I>
</LI>
</UL>
<I>Un programa es software libre si los usuarios tienen todas estas
libertades. As&#237; pues, usted deber&#237;a tener la libertad de distribuir
copias, sea con o sin modificaciones, sea gratis o cobrando una cantidad
por la distribuci&#243;n, a cualquiera y en cualquier lugar. El ser libre
de hacer esto significa, entre otras cosas, que no tiene que pedir
o pagar permisos.</I>

<p align=justify>
Llamaremos en adelante <I>&quot;Software Libre&quot;</I> a todo programa
distribuido con una licencia que permita estas cuatro libertades,
en tanto que nos referiremos a los que de alguna manera las limiten
como <I>&quot;Software Propietario&quot;</I>.

<p align=justify>

<H2><A NAME="SECTION00012000000000000000">
1.2 Costo de la obtenci&#243;n del software</A>
</H2>

<p align=justify>
Como queda expuesto en el punto anterior, hablar de Software Libre
no implica asumir que el costo de su obtenci&#243;n es cero. Los conceptos
de &quot;gratuidad&quot; y &quot;libertad&quot; son ortogonales, por lo tanto
no deben confundirse.

<p align=justify>
En lo subsiguiente, cuando queramos referirnos al precio pagado por
la obtenci&#243;n de una copia de software o una licencia de uso, lo haremos
expl&#237;citamente.

<p align=justify>

<H1><A NAME="SECTION00020000000000000000">
2 Desarrollo</A>
</H1>

<p align=justify>
En esta secci&#243;n analizaremos los distintos aspectos relacionados con
el uso de software en la formaci&#243;n de profesionales en Inform&#225;tica.
Desarrollaremos dicho an&#225;lisis desde tres enfoques diferentes: el
econ&#243;mico, el acad&#233;mico y el &#233;tico.

<p align=justify>

<H2><A NAME="SECTION00021000000000000000">
2.1 Aspecto econ&#243;mico</A>
</H2>

<p align=justify>
Aunque, como aclaramos previamente, la libertad del software no implica
su gratuidad, esto no invalida el hecho de que el software propietario
es altamente costoso tanto en su adquisici&#243;n como en su mantenimiento.

<p align=justify>
El alto precio de las licencias de uso, en las que se basa el modelo
de comercializaci&#243;n y distribuci&#243;n propietario, hacen que los montos
que debieran invertirse en la adquisici&#243;n del derecho de utilizaci&#243;n
sean muy elevados.

<p align=justify>
Dichos costos (pagados por estaci&#243;n de trabajo, por usuario o, en
algunos casos, por cantidad de CPUs) contrastan notoriamente con los
costos de adquisici&#243;n de los productos licenciados como software libre.

<p align=justify>
Cabe aqu&#237; resaltar una diferencia radical entre ambos modelos: en
el caso del Software Propietario, lo que se adquiere al pagar el precio
de una licencia es el permiso de ejecutar el programa en cuesti&#243;n
bajo determinadas condiciones, en tanto que al adquirir una pieza
de Software Libre se obtiene una copia del programa (incluyendo su
c&#243;digo fuente) y el permiso del autor para hacer uso de las cuatro
libertades que definen a este tipo de software.

<p align=justify>
El impacto de las licencias del Software Propietario no s&#243;lo debe
tenerse en cuenta a la hora de evaluar los costos de equipar un laboratorio
inform&#225;tico en una instituci&#243;n educativa, sino que tambi&#233;n debe atenderse
al hecho de que aquellos alumnos que quieran utilizar las mismas herramientas
en su hogar tambi&#233;n deber&#225;n adquirir dichas licencias.

<p align=justify>

<H2><A NAME="SECTION00022000000000000000">
2.2 Aspecto acad&#233;mico</A>
</H2>

<p align=justify>
Aunque el objetivo de la educaci&#243;n de nivel universitario no es formar
especialistas en determinada tecnolog&#237;a, es indudable que a la hora
de aplicar los conceptos te&#243;ricos debe optarse por alguna en particular.
Es una obligaci&#243;n, por parte del docente, el seleccionar cuidadosamente
las tecnolog&#237;as m&#225;s convenientes a tal efecto.

<p align=justify>
En el caso del software, a trav&#233;s de la historia, una serie de empresas
-que han gozado de una situaci&#243;n de monopolio- han pretendido marcar
el rumbo tecnol&#243;gico. Invariablemente, estas empresas han tratado
de ejercer presi&#243;n sobre el sistema acad&#233;mico para lograr el acercamiento
de los estudiantes a sus productos, invirtiendo en muchos casos elevadas
sumas de dinero a tal efecto (bajo la forma de convenios o donaciones).

<p align=justify>
Creemos que el uso de herramientas propietarias, generalmente ligadas
a tecnolog&#237;as espec&#237;ficas bajo el control de determinadas empresas,
contribuye a lograr una fuerte dependencia del futuro profesional
en las mismas. Luego, dicho profesional en el desempe&#241;o de sus actividades,
actuar&#225; como un agente de ventas de dicha empresa al ofrecer a sus
clientes soluciones basadas exclusivamente en los productos que conoce.

<p align=justify>
Por contrapartida, al utilizar herramientas libres, se le brinda al
estudiante la posibilidad de conocer los detalles de la implementaci&#243;n
de las mismas y los fundamentos tecnol&#243;gicos en los que &#233;stas se basan.

<p align=justify>
A modo de ejemplo, podr&#237;amos nombrar el caso de materias como &quot;Compiladores&quot;,
&quot;Sistemas Operativos&quot;, &quot;Redes y telecomunicaciones&quot;, entre
otras, las cuales dif&#237;cilmente podr&#237;an dictarse correctamente sin
la existencia de herramientas libres que permitan analizar las distintas
implementaciones y utilizarlas para aplicar los conceptos te&#243;ricos.
Es preciso notar que la mayor&#237;a de estos programas, muchos de ellos
de excelentes cualidades t&#233;cnicas, han surgido del &#225;mbito acad&#233;mico.

<p align=justify>

<H2><A NAME="SECTION00023000000000000000">
2.3 Aspecto &#233;tico</A>
</H2>

<p align=justify>
En el apartado anterior hemos hecho notar c&#243;mo la incorrecta elecci&#243;n
de las herramientas utilizadas en la educaci&#243;n puede llegar a provocar
una alta dependencia de las mismas por parte del alumno, y favorecer
los intereses de las empresas que las comercializan. En este sentido,
no es extra&#241;o que grandes corporaciones productoras de software ofrezcan
tratos aparentemente muy ventajosos a instituciones educativas, a
fin de obtener la &quot;exclusividad&quot; del uso de sus productos en
determinada materia o laboratorio.

<p align=justify>
Con relaci&#243;n al alto costo de las licencias de uso, es una actividad
muy com&#250;n en la actualidad (al menos en nuestro pa&#237;s), la utilizaci&#243;n
de &quot;copias no autorizadas&quot; de productos propietarios (a lo que
se le suele asignar el desafortunado nombre de &quot;pirater&#237;a&quot;<A NAME="tex2html4"
  HREF="#foot78"><SUP>4</SUP></A>). La pr&#225;ctica de este tipo de actividades conlleva las siguientes
consecuencias:

<p align=justify>

<UL>
<LI>La violaci&#243;n de las condiciones de la licencia correspondiente al
producto utilizado de forma irregular constituye lisa y llanamente
una violaci&#243;n de la ley.
</LI>
<LI>El uso de copias no autorizadas contribuye a la estrategia utilizada
por las empresas productoras de software propietario para promocionar
sus productos y provocando as&#237; el llamado &quot;efecto de red&quot;, ya
que al tratarse de tecnolog&#237;a cerrada y bajo el control de dichas
empresas, se est&#225; propiciando el establecimiento de la misma como
un est&#225;ndar &quot;de facto&quot;.
</LI>
</UL>
Adem&#225;s, la elecci&#243;n de determinada herramienta propietaria para el
desarrollo de las actividades en el marco del dictado de una materia,
restringe al alumno a su utilizaci&#243;n, oblig&#225;ndolo en algunos casos
a realizar copias no autorizadas, incurriendo de esta forma en el
mismo delito y aumentando el &quot;efecto de red&quot;.

<p align=justify>

<H1><A NAME="SECTION00030000000000000000">
3 Conclusiones</A>
</H1>

<p align=justify>

<H2><A NAME="SECTION00031000000000000000">
3.1 El Software Propietario favorece la dependencia tecnol&#243;gica</A>
</H2>

<p align=justify>
Como ha quedado de manifiesto por lo dicho en las secciones precedentes,
el uso de Software Propietario en la educaci&#243;n favorece la dependencia
tecnol&#243;gica, no s&#243;lo de los futuros profesionales sino tambi&#233;n de
sus futuros clientes (o alumnos, en el caso en que dicho profesional
incursione en la docencia).

<p align=justify>
El uso de productos propietarios como &quot;cajas negras&quot; es totalmente
incompatible con el concepto de &quot;educaci&#243;n&quot;, cambi&#225;ndolo por
el de &quot;entrenamiento&quot; (utilizando palabras del mismo Edsger
Dijkstra).

<p align=justify>

<H2><A NAME="SECTION00032000000000000000">
3.2 El Software Libre favorece el avance tecnol&#243;gico</A>
</H2>

<p align=justify>
Aunque la definici&#243;n de &quot;Software Libre&quot; s&#243;lo data de unas d&#233;cadas
atr&#225;s, el concepto de libertad ha estado asociado desde siempre al
desarrollo de las ciencias. Es as&#237; como han podido evolucionar la
matem&#225;tica, la f&#237;sica, y otras disciplinas. Recordemos la c&#233;lebre
frase de Isaac Newton: <I>&quot;Si he visto m&#225;s lejos que otros,
es porque estaba parado sobre el hombro de gigantes&quot;</I>.

<p align=justify>
El Software Libre, al permitir el uso irrestricto, el an&#225;lisis y la
reutilizaci&#243;n de los programas impulsa fuertemente el intercambio
de conocimientos y la colaboraci&#243;n entre programadores de todo el
mundo.

<p align=justify>

<H2><A NAME="SECTION00033000000000000000">
3.3 Necesidad de una pol&#237;tica institucional</A>
</H2>

<p align=justify>
Ante los peligros que puede acarrear la incorrecta elecci&#243;n de herramientas
propietarias en la formaci&#243;n universitaria, creemos que &#233;sta es una
decisi&#243;n que no puede quedar librada al criterio de cada docente,
sino que debe definirse una pol&#237;tica institucional que determine los
lineamientos para la elecci&#243;n de herramientas y tecnolog&#237;as inform&#225;ticas
en las distintas actividades desarrolladas dentro de su &#225;mbito.

<p align=justify>

<H2><A NAME="SECTION00034000000000000000">
3.4 Consideraciones finales</A>
</H2>

<p align=justify>
En atenci&#243;n a la brevedad de este documento, hemos omitido tratar
en &#233;l algunos temas tales como el verdadero &quot;secuestro&quot; de la
informaci&#243;n que se logra mediante el uso de formatos cerrados (que
utilizan gran parte de programas propietarios), las pr&#225;cticas monop&#243;licas
que llevan adelante muchas empresas productoras de software propietario,
o el peligro inminente que representan para el avance de la ciencia
inform&#225;tica el otorgamiento de patentes relacionadas con productos
de software.

<p align=justify>
Sin embargo, creemos que los argumentos aqu&#237; expuestos son suficientes
para promover una discusi&#243;n profunda acerca de la postura a adoptar
por parte de las instituciones educativas relacionadas con la Inform&#225;tica
respecto de las herramientas y las tecnolog&#237;as utilizadas en la formaci&#243;n
de sus alumnos.
<p align=justify>

<H1>Copyright</H1>

<p align=justify>

<b>Copyright &copy; 2002 Javier Smaldone</b><br>
<b>Copyright &copy; 2002 Maximiliano Eguaras</b><br>
Se garantiza el permiso para copiar, distribuir y/o modificar este
documento bajo los términos de la Licencia de Documentación
Libre GNU, versión 1.2 (GNU Free Documentation License, Version
1.2) o cualquier otra versión posterior publicada por la Free Software
Foundation; este documento se presenta sin Secciones Invariables (no Invariant
Sections), sin Textos de Tapa (no Front-Cover Texts) y sin Textos de Contratapa
(no Back-Cover Texts).</p>
<p align=justify>
Una copia de la licencia puede obtenserse desde <a href="http://www.gnu.org/copyleft/fdl.html"
target="_blank">http://www.gnu.org/copyleft/fdl.html</a>
</p>
<BR><HR><H3>Referencias</H3>
<DL>
<DT><A NAME="foot80">... Smaldone</A><A
 HREF="sl_informatica.html#tex2html1"><SUP>1</SUP></A></DT>
<DD>
{maeguaras@dc.exa.unrc.edu.ar - javier@smaldone.com.ar)


</DD>
<DT><A NAME="foot73">... Cuarto</A><A
 HREF="sl_informatica.html#tex2html2"><SUP>2</SUP></A></DT>
<DD>
http://www.unrc.edu.ar


</DD>
<DT><A NAME="foot74">... Foundation</A><A
 HREF="sl_informatica.html#tex2html3"><SUP>3</SUP></A></DT>
<DD>http://www.fsf.org/philosophy/free-sw.html


</DD>
<DT><A NAME="foot78">...&quot;piratería&quot;</A><A
 HREF="sl_informatica.html#tex2html4"><SUP>4</SUP></A></DT>
<DD>http://www.gnu.org/philosophy/words-to-avoid.es.html


</DD>
</DL>
<HR>
<br>
</BODY>
</HTML>
